// Задача 10. Программа принимает на взходе 3-х значеное число
// и на выходе показывает 2-ую цифру этого числа
Console.WriteLine(" --- Task 10 ---");

Console.Write("Input three-digit digit, please: ");
String strDigin = Console.ReadLine();
Console.Write("The second digit is: ");
Console.WriteLine(strDigin[1]);
